In [1]:
"""
Data Input oupt using csv, Excel, HTML and SQL
"""

'\nData Input oupt using csv, Excel, HTML and SQL\n'

In [2]:
import pandas as pd

In [5]:
df = pd.read_csv('mycsv.csv')

In [6]:
df

   1  Meera  25 teacher
0  2    Sam  32  dancer
1  3   Nola  28  doctor
2  4  Peter  22  artist

In [8]:
df.to_csv('my_new_output.csv', index=False)

In [12]:
df1 = pd.read_excel('Lec_28_test.xlsx')

In [15]:
df1.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet')

In [13]:
df1

   This is a test  Unnamed: 1  Unnamed: 2
0              23        6678         456
1             234         678         456
2             234           7         345
3              34          56         234
4               5         456        4365

In [16]:
data = pd.read_html("https://www.fdic.gov/bank/individual/failed/banklist.html")

In [17]:
type(data)

list

In [19]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [20]:
from sqlalchemy import create_engine

In [21]:
engine = create_engine('sqlite:///:memory:')

In [22]:
df

   1  Meera  25 teacher
0  2    Sam  32  dancer
1  3   Nola  28  doctor
2  4  Peter  22  artist

In [23]:
df.to_sql('my_table', engine)

In [24]:
sql_df = pd.read_sql('my_table', con = engine)

In [25]:
sql_df

   index  1  Meera  25 teacher
0      0  2    Sam  32  dancer
1      1  3   Nola  28  doctor
2      2  4  Peter  22  artist

In [26]:
type(sql_df)

pandas.core.frame.DataFrame